# Preprocessing & Dataset Build

This notebook builds a clean dataset from the raw flight price data.
All preprocessing logic is implemented in `src/preprocessing.py`.

In [7]:
import pandas as pd
from pathlib import Path
import sys


PROJECT_ROOT = Path("..") 
sys.path.append(str(PROJECT_ROOT)) 

RAW_PATH = PROJECT_ROOT / "data" / "raw" / "data.xlsx"
OUT_PATH = PROJECT_ROOT / "data" / "processed" / "flight_prices_processed.csv"

RAW_PATH, OUT_PATH

(PosixPath('../data/raw/data.xlsx'),
 PosixPath('../data/processed/flight_prices_processed.csv'))

In [8]:
df_raw = pd.read_excel(RAW_PATH)
df_raw.shape

(10683, 11)

In [9]:
df_raw.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [10]:
from src.preprocessing import base_preprocess

df = base_preprocess(df_raw)
df.shape

(10660, 13)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10660 entries, 0 to 10682
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Airline        10660 non-null  object
 1   Source         10660 non-null  object
 2   Destination    10660 non-null  object
 3   Total_Stops    10660 non-null  int64
 4   Price          10660 non-null  int64
 5   Price_USD      10660 non-null  float64
 6   Duration_min   10660 non-null  int64
 7   Journey_day    10660 non-null  int32
 8   Journey_month  10660 non-null  int32
 9   Dep_hour       10660 non-null  int32
 10  Dep_min        10660 non-null  int32
 11  Arr_hour       10660 non-null  int32
 12  Arr_min        10660 non-null  int32
dtypes: float64(1), int32(6), int64(3), object(3)
memory usage: 916.1+ KB

In [12]:
df.head()

,Airline,Source,Destination,Total_Stops,Price,Price_USD,Duration_min,Journey_day,Journey_month,Dep_hour,Dep_min,Arr_hour,Arr_min
0,IndiGo,Banglore,New Delhi,0,3897,46.764,170,24,3,22,20,1,10
1,Air India,Kolkata,Banglore,2,7662,91.944,445,1,5,5,50,13,15
2,Jet Airways,Delhi,Cochin,2,13882,166.584,1140,9,6,9,25,4,25
3,IndiGo,Kolkata,Banglore,1,6218,74.616,325,12,5,18,5,23,30
4,IndiGo,Banglore,New Delhi,1,13302,159.624,285,1,3,16,50,21,35

In [13]:
df.isna().sum().sort_values(ascending=False).head(15)

Airline          0
Source           0
Destination      0
Total_Stops      0
Price            0
Price_USD        0
Duration_min     0
Journey_day      0
Journey_month    0
Dep_hour         0
Dep_min          0
Arr_hour         0
Arr_min          0
dtype: int64

In [14]:
df.describe(include="all").T.head(20)

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Airline,10660,8,Jet Airways,3849,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Source,10660,5,Delhi,4522,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Destination,10660,6,Cochin,4522,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Total_Stops,10660.0,NaN,NaN,NaN,0.823827,0.6756,0.0,0.0,1.0,1.0,4.0
Price,10660.0,NaN,NaN,NaN,9056.987054,4457.0563,1759.0,5267.0,8372.0,12373.0,54826.0
Price_USD,10660.0,NaN,NaN,NaN,108.683845,53.484676,21.108,63.204,100.464,148.476,657.912
Duration_min,10660.0,NaN,NaN,NaN,643.462008,508.248688,5.0,170.0,520.0,930.0,2860.0
Journey_day,10660.0,NaN,NaN,NaN,13.509193,8.477904,1.0,6.0,12.0,21.0,27.0
Journey_month,10660.0,NaN,NaN,NaN,4.712195,1.162999,3.0,3.0,5.0,6.0,6.0
Dep_hour,10660.0,NaN,NaN,NaN,12.497749,5.748546,0.0,8.0,11.0,18.0,23.0
Dep_min,10660.0,NaN,NaN,NaN,24.415572,18.762391,0.0,5.0,25.0,40.0,55.0
Arr_hour,10660.0,NaN,NaN,NaN,13.347561,6.861826,0.0,8.0,14.0,19.0,23.0
Arr_min,10660.0,NaN,NaN,NaN,24.689962,16.511901,0.0,10.0,25.0,35.0,55.0

## Output schema

- `Price_USD`: converted target variable
- `Duration_min`: numeric duration in minutes
- Parsed stops and cleaned categorical variables
- Extracted time features

In [15]:
OUT_PATH.parent.mkdir(parents=True, exist_ok=True)
df.to_csv(OUT_PATH, index=False)
print(f"Saved: {OUT_PATH} | rows={len(df):,} cols={df.shape[1]}")

Saved: ../data/processed/flight_prices_processed.csv | rows=10,660 cols=13

In [16]:
df_check = pd.read_csv(OUT_PATH)
df_check.shape, df_check.head()

((10660, 13),
        Airline    Source Destination  Total_Stops  Price  Price_USD  \
 0       IndiGo  Banglore   New Delhi            0   3897     46.764
 1    Air India   Kolkata    Banglore            2   7662     91.944
 2  Jet Airways     Delhi      Cochin            2  13882    166.584
 3       IndiGo   Kolkata    Banglore            1   6218     74.616
 4       IndiGo  Banglore   New Delhi            1  13302    159.624

    Duration_min  Journey_day  Journey_month  Dep_hour  Dep_min  Arr_hour  \
 0           170           24              3        22       20         1
 1           445            1              5         5       50        13
 2          1140            9              6         9       25         4
 3           325           12              5        18        5        23
 4           285            1              3        16       50        21

    Arr_min
 0       10
 1       15
 2       25
 3       30
 4       35  )